<template>
  <el-dialog @close="handleUserTermDialogClosed"
             width="80%"
             class="user-terms-dialog"
             :title="$t('m.userTerms')"
             :visible.sync="$store.state.userTermDialogVisible"
             append-to-body>
            <div class="es-section">
              <pre>版权申明
衷心感谢您关注和支持羚课日本留学，如果您需要转载羚课日本留学）的视频、资料、新闻与资讯等内容信息,请仔细阅读本版权声明：

  1、羚课日本留学对所提供的教学视频、教学成果、服务及本服务所使用的软件、资料均受知识产权法或其他法律保护的资料享有相应的权利，包括但不限于受到著作权法及其实施细则、商标法及其实施细则、专利法及其实施细则或其他法律的保护。
  2、羚课日本留学提供的网上内容，其版权归羚课日本留学所有（除特殊声明版权所有单位的除外），包括但不限于全部的视频文件、文字、图像、声音文件、网站设计等。未经羚课日本留学授权许可，用户不得进行传播（包括转载、转贴等）、修改、出租、散布或演绎衍生其他作品，任何组织或个人不得复制或在非羚课日本留学所属的服务器上做镜像。
  3、羚课日本留学VI标识、设计以及产品及服务名称等，均为羚课日本留学所享有，只用于羚课日本留学及经许可的授权合作机构。非经授权，任何人不得使用、复制或作其他用途。
  4、本网站为用户提供评论和提问等服务时，对于本版内用户所发布的内容所引发的有关版权、著作权等知识产权的异议、纠纷及诉讼不承担任何责任。提交者发言纯属个人行为，与本网站立场无关。
  5、本网所有内容，凡注明来源为“羚课日本留学”的所有文字、图片和音频、视频资料，版权均属羚课日本留学所有，任何媒体、网站或个人未经本网协议书面授权，不得转载、链接、转贴或以其他方式复制发布或发表。已经本网协议授权的媒体、网站，在下载使用时必须注明"稿件来源：羚课日本留学, http://www.52japan.com）"，违者本网将依法追究责任。非羚课日本留学来源的文/图等稿件，本网转载出于传递更多信息之目的，并不意味着赞同其观点或证实其内容的真实性。
  6、除注明来源为“羚课日本留学”的内容外，本网以下内容亦不可任意转载：
    a.本网所指向的非本网内容的相关链接内容；
    b.已作出不得转载或未经许可不得转载声明的内容；
    c.未由本网署名或本网引用、转载的他人作品等非本网版权内容；
    d.本网中特有的图形、标志、页面风格、编排方式、程序等；
    e.本网中必须具有特别授权或具有注册用户资格方可知晓的内容；
    f.其他法律不允许或本网认为不适合转载的内容。
    7、转载或引用本网内容必须是以新闻性或资料性公共免费信息为使用目的的合理、善意引用，不得对本网内容原意进行曲解、修改，同时必须保留本网注明的“稿件来源”，并自负版权等法律责任。
    8、转载或引用本网内容不得进行如下活动：
    a. 损害本网或他人利益；
    b. 任何违法行为；
    c. 任何可能破坏公秩良俗的行为；
    d. 擅自同意他人继续转载、引用本网内容；
  9、转载或引用本网版权所有之内容须注明“转自（或引自）羚课日本留学”字样，并标明本网网址 https://www.52japan.com 。
  10、转载或引用本网中的署名文章用于商业行为的，请按规定向作者支付稿酬。
  11、对于不当转载或引用本网内容而引起的民事纷争、行政处理或其他损失，本网不承担责任。
  12、对不遵守本声明或其他违法、恶意使用本网内容者，本网将依法追究其法律责任的权利。 本网站授权版权律师负责处理本网站的一切版权事务。
  13、本版权声明的解释权归羚课日本留学。

羚课日本留学
2016年6月6日

利用規約
第1条（羚课日本留学）
  「羚课日本留学」とは、株式会社Linc（以下「当社」といいます。）が提供するインターネット上の学習支援サービス https://www.52japan.com および当該サイトに付随するアプリケーション、メール配信、その他各種サービスの総称をいいます。

第2条（利用申し込みおよび本規約の適用）
  1. 羚课日本留学利用規約（以下「本規約」といいます。）は、羚课日本留学の利用申し込みをする方（以下「申込者」といいます。）および実際に羚课日本留学を利用する方（以下「利用者」といいます。）に適用されるものとします。
  2. 申込者は、羚课日本留学の仕組み、羚课日本留学により提供されるサービスの内容および本規約を理解・承諾のうえ、当社の定める手順に従い会員登録および羚课日本留学の利用申し込みをするものとし、利用者は本規約に同意のうえ羚课日本留学を利用するものとします。
  3. 申込者または利用者が未成年の場合、当該未成年である申込者および利用者は、羚课日本留学の利用に申し込みを行うこと、羚课日本留学を利用すること羚课日本留学を利用開始後に羚课日本留学に関する新たな契約を締結すること、および本規約の内容に同意することついて、親権者に事前に同意を得たうえで、羚课日本留学の申し込みおよび利用を行うものとします。当社は、未成年である申込者または利用者が羚课日本留学を申し込みまたは利用したことをもって、親権者に同意を得ているものとみなします。
  4. 親権者は、申込者および利用者が羚课日本留学上で行う一切の行為および契約について、いかなる場合においても連帯して責任を負うものとします。
  5. 当社が羚课日本留学で提示する、運用ルール、プライバシーポリシー、およびその他諸注意等（以下「諸注意等」といいます。）が存在する場合には、諸注意等はそれぞれ本規約の一部を構成するものとします。
  6. 当社は申込者が羚课日本留学の利用申し込みを行ったこと、または利用者が羚课日本留学に含まれるコンテンツや各種情報を閲覧・使用・ダウンロード等をしたことをもって、申込者または利用者が本規約に同意したものとみなします。

第3条（ユーザーアカウント）
  1. 利用者は、羚课日本留学の申し込み方法によって異なる以下のいずれかの方法により、羚课日本留学の会員登録および羚课日本留学の利用に必要なIDおよびパスワード（以下「ユーザーアカウント」といいます。）を取得するものとします。利用者は、ユーザーアカウントを取得後、会員登録が完了していない場合は、当社定める手順に従い会員登録を行うものとします。

    (1) 申込者と利用者が同一の場合
      申込者（利用者）による羚课日本留学の利用申し込みがなされ、当社がこれを承諾した場合には、当社からユーザーアカウントが申込者（利用者）に直接付与されます。

    (2) 利用者の親権者が申し込みを行う場合等申込者と利用者が異なる場合
      申込者による羚课日本留学の利用申し込みがなされ、当社がこれを承諾した場合には、当社からユーザーアカウントが申込者に付与され、申込者からユーザーアカウントが利用者に付与されます。申込者は、ユーザーアカウント付与時に、利用者に本規約の内容を説明のうえ遵守させるものとします。

    (3) 学校、学習塾、地方公共団体等が一括で申し込みを行った場合
      当社と利用者が所属する学校、学習塾、または地方公共団体等（以下「学校等」といいます。）との間で、利用者の羚课日本留学の利用に関する契約（以下「団体契約」といいます。）が締結された場合には、当社から学校等に対してユーザーアカウントが付与され、学校等からユーザーアカウントが利用者に付与されます。

  2. 申込者および利用者は、会員登録の際に入力または提供した情報（以下「会員情報」といいます。）の内容につき、自ら責任を負うものとします。会員情報の内容に変更が生じた場合には、申込者および利用者は、直ちに情報の更新を行い、常に最新の情報を当社に提供するものとします。
  3. 当社は、会員情報が誤っている場合など、当社が適当でないと判断したときは、ユーザーアカウントの付与または付与済のユーザーアカウントの停止を行う場合があります。
  4. 当社が発行したユーザーアカウントは、当該ユーザーアカウントの発行を受けた（本条第1項に基づき申込者または学校等から提供を受けた場合を含み、以下同様とします。）利用者のみが利用可能なものとし、第三者への譲渡、貸与を禁止します。
  5. 発行されたユーザーアカウントの利用による羚课日本留学上での行為は、すべて当該ユーザーアカウントの発行を受けた利用者の行為とみなすものとし、申込者および利用者は、自らの責任のもとで、羚课日本留学の利用、ならびに、ユーザーアカウントの管理を行うものとします。ユーザーアカウントの第三者による盗用に伴ういかなる損害の発生ついても、当社は当社に故意または重過失がある場合を除いて、当社は返金等を含め一切の責任を負いません。

第4条（有料サービス）
  申込者（申込者が利用者である場合も含み、以下本条および第5条において同様とします。）は、羚课日本留学内で当社が提供する有料サービス（以下「有料サービス」といいます。）の申し込みを希望する場合には、以下に定める内容、有料サービスの仕組みおよび有料サービスの内容を理解・承諾のうえ、当社の定める手順に従い申し込みを行うものとします。
    (1) 申込者は、有料サービスの利用を希望する場合は、当社が定めるプラン（以下「プラン」といいます。）から希望のプランおよび支払方法を選択し、申し込みを行うものとします。
    (2) 申込者が、前号に従い申し込みを行い、当社が承諾の意思表示をした場合は、プランに定める期間（以下「利用期間」といいます｡）の有料サービスに関する個別契約（以下「有料サービス契約」といいます。）が成立するものとします。
    (3) 自動更新の定めのある個別契約は、利用期間満了の日までに、所定の利用終了手続きに従って、申込者から利用終了の意思表示を受けなかった場合、さらに同一条件で延長されるものとし、以降も同様とします。
    (4) 申込者は、有料サービス利用の対価として、個別契約に従った金額（以下「有料サービス利用料」といいます。）を支払うものとします。なお、支払いの際に必要な経費（手数料、クレジットカードの会員費などをいいますが、これらに限られません）は全て、申込者の負担とします。

第5条（請求および支払方法）
  1. 申込者は、有料サービスの申し込み時に以下の支払方法を選択した場合には、以下に定める内容を承諾するものとします。なお、第三者を通じて支払が行われるため、当社は領収書の発行をいたしかねます。

    (1) プラットフォーム内課金
      Alibaba Group Holdings Limited.、Tencent Holdings Limited.、Apple Inc.、Google
      Inc.またはそのグループ会社（以下総称して「プラットフォーム提供事業者」といいます。）を介する方法を選択した場合、
      プラットフォーム提供事業者が別途定める約款に基づき、プラットフォーム提供事業者が当社に代わって回収するものとします。なお、ユーザーがプラットフォーム提供事業者へクレジットカードにより支払うことを申請している場合にはクレジットカード会社より請求されるものとします。なお、申込者がプラットフォーム提供事業者の定める支払期限を過ぎても支払わない場合、プラットフォーム提供事業者は、当社に当該ユーザーの氏名、住所、電話番号、未払い情報等を通知することができるものとします。

    (2) クレジットカード決済
      申込者がクレジットカード決済を選択した場合、当社は請求にかかる業務をソフトバンク・ペイメント・サービス株式会社に委託することができるものとします。

    (3) 銀行振込による決済
      申込者が銀行振込による決済を選択した場合、当社が指定する法人銀行口座まで、当社が定めた期日内に振込を完了させる必要があります。

  2. 申込者は、年中に有料サービス契約が終了した場合（退会、解約、当社によるユーザーアカウントの停止等理由の如何を問いません。）においても、当年分の有料サービス利用料につき日割り精算されないことにつき、予め承諾するものとします。

第6条（退会および解約）
  1. 申込者および利用者は、羚课日本留学の会員を退会したい場合、当社所定の手続きを行うものとします。
  2. 当社は、申込者もしくは利用者が退会をした場合、または学校等が団体契約を解除もしくは解約した場合において、当社が羚课日本留学において申込者または利用者が登録した情報および利用者による利用履歴の全部または一部を削除したとしても、利用者はこれに関して一切異議を唱えられないものとします。申込者および利用者は、自らの責任で必要な情報を保管するものとします。なお、本項は本項に定める場合以外において当社が当該情報および履歴等を保管する義務を定めるものではありません。

第7条（ユーザーアカウントの停止および抹消）
  1. 当社は、（A）申込者もしくは利用者が本規約に違反したと判断した場合、（B）学校等が団体契約に違反したと判断した場合、（C）団体契約に基づき利用する利用者のうち一の利用者が本規約に違反した場合、事前に通知することなく、当該申込者または利用者（（A）当該申込者の申し込みにおいて利用する利用者、（B）団体契約に基づき利用する利用者、（C）同一の団体契約に基づき利用する当該利用者以外の利用者、を含みます。）のユーザーアカウントの停止および抹消、将来に渡った会員登録の禁止、当社との間の一切の契約の解除等、当社が適切と判断した措置を行うことができるものとします。
  2. 当社は、利用者が一定期間以上羚课日本留学を利用しない場合、または当社が必要と認めた場合には、当該利用者に対し事前に通知したうえで、ユーザーアカウントを停止および抹消を行うことができるものとします。

第8条（禁止行為）
  1.  申込者および利用者は、羚课日本留学において以下の行為または以下の行為に該当する恐れのある行為をしてはならないものとします。
    (1) 意図的に虚偽の情報または誤解を招く情報を登録する行為
    (2) 著作権、商標権、プライバシー権、氏名権、肖像権、名誉等の他人の権利を侵害する行為
    (3) 個人や団体を誹謗中傷する行為
    (4) 法令、公序良俗に反する行為、またはそのおそれがある行為
    (5) 当社が羚课日本留学上で提供する各種サービスを不正の目的をもって利用する行為
    (6) 羚课日本留学上で発生した不具合を利用する行為
    (7) 当社の承諾なく、営利を目的とした情報提供等の行為
    (8) 羚课日本留学の運営を妨げる行為、または当社の信頼を毀損する行為
    (9) 本規約に違反する行為および、当社が別途定める羚课日本留学ID規約に違反する行為
    (10) その他当社が不適切・不適当であると判断した行為

  2. 前項に掲げる行為によって、当社または第三者に損害が生じた場合、申込者および利用者はすべての法的責任を負うものとし、当社および第三者に損害を与えないものとします。申込者が利用者の親権者である場合、利用者が前項に掲げる行為によって、当社または第三者に損害が生じた場合、申込者はすべての法的責任を負うものとします。
  3. 当社は、申込者および利用者が前2項に掲げる行為を行ったと合理的に判断した場合、事前に通知することなく、ユーザーアカウントの停止および抹消、将来に渡った会員登録の禁止等、当社が適切と判断した措置を行うことができるものとします。

第9条（サービスの停止、中断、変更および終了）
  1. 当社は、以下の各号に該当する場合には、申込者および利用者への事前の通知をすることなく、羚课日本留学の停止および中断を行うことがあります。
    (1) 羚课日本留学の保守または仕様の変更を行う場合
    (2) 天変地異その他非常事態が発生し、または発生するおそれがあり、羚课日本留学上で提供する各種サービスの一部または全部の運営ができなくなった場合
    (3) 当社がやむを得ない事由により羚课日本留学上で提供する各種サービスの停止が必要であると判断した場合
  2. 当社は、利用者へ事前の通知をすることなく、羚课日本留学の内容および仕様をいつでも変更することができるとします。
  3. 当社は、1ヶ月の予告期間をもって申込者および利用者に通知のうえ、羚课日本留学を長期的に中断または終了することがあります。

第10条（著作権等）
  1. 羚课日本留学を通じて提供されるすべての文章、画像、映像、音声、プログラム等のコンテンツについての著作権等の知的財産権は当社または当該コンテンツ提供元に帰属するものであり、申込者および利用者は、当社の事前の承諾なく、複製、転載等の使用をすることはできません。
  2. 本条の規定に違反して紛争が生じた場合、申込者および利用者は、自己の費用と責任において、当該紛争を解決するとともに、当社および第三者に一切の損害を与えないものとします。申込者が利用者の親権者である場合、利用者が本条の規定に違反したことによって紛争が生じた場合、申込者は、自己の費用と責任において、当該紛争を解決するとともに、当社および第三者に一切の損害を与えないものとします。

第11条（不可抗力）
  1. 当社は、通常講ずるべき対策では防止できないウィルス被害、停電被害、サーバ故障、回線障害、および天変地異による被害、その他当社の責によらない不可抗力に基づく事由（以下「不可抗力」といいます。）による被害が申込者または利用者に生じた場合、一切責任を負わないものとします。
  2. 当社は、不可抗力に起因して羚课日本留学において管理または提供されるデータが消去・変更されないことを保証しません。

第12条（当社の非保証）
  1. 当社は、（A）羚课日本留学の提供に不具合やエラーや障害が生じないこと、（B）羚课日本留学から得られる情報等が正確なものであること、（C）羚课日本留学を通じて入手できる役務、情報等が利用者の期待を満たすものであることのいずれについても保証するものではありません。
  2. 申込者および利用者は、羚课日本留学上で提供される情報（学校情報等の第三者の情報、広告その他第三者により提供される情報等を含みますが、これらに限られません）について、その最新性、真実性、合法性、安全性、適切性、有用性、合格の確実性等、羚课日本留学による効果一切等について何ら保証しないことを了承のうえ、自己の責任において羚课日本留学を申し込みおよび利用するものとします。万が一、当該情報に関して何らかのトラブルが生じた場合にも、当社は何ら責任を負いません。ただし、当社の故意または重過失により当該トラブルが発生した場合は、この限りではありません。

第13条（羚课日本留学の利用に係る機器および通信費）
  利用者は、羚课日本留学を利用するにあたって必要な通信端末および通信機器等の通信環境を自らの費用と責任において整えるものとします。また、羚课日本留学の利用にあたって必要な通信費用等は当社は一切負担しないものとします。

第14条（反社会的勢力の排除）
  1. 当社、申込者および利用者は、現在、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標ぼうゴロまたは特殊知能暴力集団等、その他これらに準ずる者（以下「暴力団員等」といいます。）に該当しないこと、および次の各号のいずれにも該当しないことを表明し、かつ将来にわたっても該当しないことを確約します。
    (1) 暴力団員等が経営を支配していると認められる関係を有すること
    (2) 暴力団員等が経営に実質的に関与していると認められる関係を有すること
    (3) 自己、自社もしくは第三者の不正の利益を図る目的または第三者に損害を加える目的をもってするなど、不当に暴力団員等を利用していると認められる関係を有すること
    (4) 暴力団員等に対して資金等を提供し、または便宜を供与するなどの関与をしていると認められる関係を有すること
    (5) 役員または経営に実質的に関与している者が暴力団員等と社会的に非難されるべき関係を有すること
  2. 当社、申込者および利用者は、自らまたは第三者を利用して次の各号の一にでも該当する行為を行わないことを確約します。
    (1) 暴力的な要求行為
    (2) 法的な責任を超えた不当な要求行為
    (3) 風説を流布し、偽計を用いまたは威力を用いて相手方の信用を毀損し、または相手方の業務を妨害する行為
    (4) 法令、公序良俗に反する行為、またはそのおそれがある行為
    (5) その他前各号に準ずる行為

第15条（当社の責任）
  当社は、羚课日本留学（これに付随する当社または第三者の情報提供行為等を含みます。）、その他羚课日本留学を通じてアクセスできる第三者が提供するウェブサイトおよびサービスに関して、申込者または利用者生じる一切の損害（精神的苦痛、進学活動の中断、またはその他の金銭的損失を含む一切の不利益を含みますが、これらに限られません。）につき、当社に故意または重大な過失がある場合を除いて、一切の責任を負わないものとします

第16条（規約の変更）
  1. 当社は、利用者、申込者および学校等に事前の通知をすることなく本規約および諸注意等を変更することができるものとします。
  2. 変更された本規約および諸注意等は、これらを羚课日本留学上に掲示した後、利用者が羚课日本留学を利用した時点をもって承諾されたものとみなします。

第17条（個人情報）
  個人情報の取扱いについては、別途定めるプライバシーポリシーに従うものとします。

第18条（分離条項）
  本規約および諸注意等に定めるいずれかの条項が管轄権のある裁判所により無効である旨判断された場合には、かかる条項は、法律が許容する限りで、本来の条項の趣旨を最大限実現するように変更または解釈されるものとし、また、本規約および諸注意等のその他の条項の効力には何らの影響を与えないものとします。

第19条（準拠法および管轄）
  規約の準拠法は日本法とし、本規約に関する一切の紛争は、東京地方裁判所または東京簡易裁判所を第一審の専属的合意管轄裁判所とします。

2016年6月6日 作成・適用</pre>
            </div>
  </el-dialog>
</template>

<script>
  export default {
    methods: {
      handleUserTermDialogClosed() {
        this.$store.state.userTermDialogVisible = false;
      }
  }
}
</script>

<style lang="less">
  .user-terms-dialog {
    .es-section pre {
      overflow: auto;
      white-space: pre-wrap;
      word-wrap: break-word;
    }
    .el-dialog__body {
      height: 600px;
      overflow: scroll;
      &::-webkit-scrollbar {
        width: 5px;
      }
    }
  }
</style>